




Point-to-Point Protocol Extension Group                   Mikael Latvala
INTERNET DRAFT                                         Oy LM Ericsson Ab
Expires September 13, 1997                                    George Liu
                                                  Ericsson Radio Systems
                                                          March 13, 1997


                   Semi Connected Mode for PPP links
                    <draft-ietf-pppext-scm-00.txt>


Status of this Memo

   This document is an Internet-Draft.  Internet-Drafts are working
   documents of the Internet Engineering Task Force (IETF), its areas,
   and its working groups.  Note that other groups may also distribute
   working documents as Internet-Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as ``work in progress.''

   To learn the current status of any Internet-Draft, please check the
   ``1id-abstracts.txt'' listing contained in the Internet-Drafts Shadow
   Directories on ftp.is.co.za (Africa), nic.nordu.net (Europe),
   munnari.oz.au (Pacific Rim), ds.internic.net (US East Coast), or
   ftp.isi.edu (US West Coast).

   Distribution of this memo is unlimited.


Abstract

   The configuration of a Point-to-Point Protocol (PPP) [1] link
   requires a considerable amount of time which makes it impractical to
   establish a new PPP link every time an end-user wants to send or is
   about to receive data.

   This document proposes an LCP extension called Semi Connected Mode.
   When both sides agree to use Semi Connected Mode they can terminate
   and quickly re-establish the bearer service without having to recon-
   figure the PPP link.








Latvala & Liu          expires September 13, 1997               [Page i]

Internet Draft     Semi Connected Mode for PPP links      March 13, 1997


   Table of Contents

     1.     Introduction ..........................................    1
        1.1       Motivation ......................................    1
        1.2       Specification of Requirements ...................    3
        1.3       Terminology .....................................    3
     2.     PPP Link Operation to support Semi Connected Mode .....    5
        2.1       Phase Diagram ...................................    5
        2.2       Semi-Connected Phase ............................    5
     3.     LCP State Translation Table ...........................    7
        3.1       States ..........................................    8
        3.2       Events ..........................................   10
        3.3       Actions .........................................   11
     4.     Semi Connected Mode Option for LCP Configuration ......   12
     5.     Security Considerations ...............................   14

     REFERENCES ...................................................   14
     AUTHORS' ADDRESSES ...........................................   15

































Latvala & Liu          expires September 13, 1997              [Page ii]

Internet Draft     Semi Connected Mode for PPP links      March 13, 1997


1. Introduction

1.1 Motivation

   The exponential growth of the Internet within the last three years
   has placed new requirements on local telephone companies that offer
   communication services to the public. Originally telephone companies'
   end offices were designed to transmit only human voice which has very
   different characteristics than data, e.g. data traffic is bursty and
   does not require a strict timing relationship between the source and
   the destination whereas voice traffic is very sensitive to delays.
   The sheer number of users that access Internet Service Providers'
   (ISP) services using regular dial-up lines to explore the Internet,
   and the duration of those connections is in many places testing the
   limits of end offices. Trunk lines which connect an end office to
   other switching centers are not intended to support lengthy
   connections, which are very common when telephone companies do not
   charge customers based on the duration of their connections.

   To take some of the burden off the end offices' shoulders telecom
   manufacturers have started to offer solutions where phone connections
   are terminated at the premises of a local telephone company.
   Customers connect to an end office which has a Network Access Server
   (NAS). Connections to end offices are either analog or digital
   depending on whether an end-user has an ISDN connection or a POTS
   connection. NAS is informed of locally terminated connections after
   which it routes the packets it receives from customers to their
   proper destinations using transportation techniques which are better
   suited for data traffic (SMDS, ATM, Frame relay). Local telephone
   companies which operate NASs can either assume the role of ISP or
   just offer a fat data pipe to an ISP which is operating independently
   of a telephone company.

   Parallel to the Internet's growth, the cellular systems have seen
   tremendous success. Mobile offices are slowly gaining popularity
   among people who need to travel with portable computers and still
   want to maintain connections to their corporate Intranets or to the
   Internet. To respond to the growing number of mobile office users,
   telecom manufactures have introduced a new data service in cellular
   systems (e.g. GSM) which is similar to the solution described above.
   In this system part of the GSM data call within the Public Land
   Mobile Network (PLMN) is not routed through a public ISDN or PSTN,
   but, instead terminated at a NAS for further transportation of data
   traffic to external data networks, that is, direct access to servers
   in a LAN or Internet.  This service offered by a digital cellular
   system considerably reduces the connection setup time because data
   service connections are terminated within the cellular system.




Latvala & Liu          expires September 13, 1997               [Page 1]

Internet Draft     Semi Connected Mode for PPP links      March 13, 1997


   However, as in many other similar cases, these technological
   improvements do not come without additional expenses which telephone
   companies are forced to collect from their customers. Most of the
   end-users who are using either cellular network or ISDN data services
   are charged based on their connection's duration. From an end-user's
   point of view this is highly undesirable because for the better part
   of the connection time end-users do not send or receive data and are
   thus paying for an idle connection. These tariffs force many end-
   users to establish a data connection only when needed, e.g. to read
   or send e-mail, and disconnect immediately after having sent or
   received data.

   End offices would not become bottlenecks if end-users connected and
   disconnected frequently in order to cut down the bearer service
   charges. Connections in digital public networks can be established in
   less than a second which would justify an end-user to disconnect from
   the bearer service after downloading a large web page for example.
   Unfortunately the most commonly used datalink-layer protocol, PPP,
   over POTS, ISDN, and cellular network lines is a very time consuming
   protocol to configure.

   Point-to-Point Protocol (PPP) is a full featured protocol which
   allows two hosts to multiplex different network-layer protocols over
   the same link, to configure the link so that it can be used in a wide
   variety of environments, to authenticate themselves, and to configure
   the network-layer protocols they are using. The reason for having
   such a variety of features is that PPP is intended to provide a
   common solution for different hosts and physical links [2]. The
   drawback of PPP is the time it takes to configure a PPP link. Test
   measurements done at Ericsson Corporation indicate that PPP
   configuration can take anywhere from 3 to 6 seconds. Although some of
   the time is attributed to bad PPP implementations where the PPP can
   not negotiate options in an orderly fashion, most of the time PPP is
   waiting for an answer from the peer.

   Semi Connected Mode (SCM) allows PPP to establish a PPP link without
   having to keep an open physical-layer connection for the duration of
   a PPP session. PPP can negotiate the timer value which determines the
   idle time which is tolerated before the physical-layer connection is
   terminated. It can also negotiate whether a peer can make a
   transition to a Semi-Connected phase and terminate the physical link.
   This feature is necessary when a peer belonging to an ISP is not
   located on a local telephone company's premises, and the local
   telephone company always charges the site of the originating call.

   SCM is an attractive option when the end-users subscribe to a digital
   bearer service (ISDN, GSM) because digital bearer services typically
   have very short connection establishment times.



Latvala & Liu          expires September 13, 1997               [Page 2]

Internet Draft     Semi Connected Mode for PPP links      March 13, 1997


   SCM can also help PLMN operators in their frequency shortage dilemma
   by minimizing the duration of data connections. End-users are more
   likely to terminate and re-establish the physical-layer connection
   when they do not suffer from the connection delay caused by the PPP
   configuration.


1.2.  Specification of Requirements

   In this document, several words are used to signify the requirements
   of the specification. These words are often capitalized.

   MUST      This word, or the adjective "required", means that the
             definition is an absolute requirement of the specification.

   MUST      This phrase means that the definition is an absolute
             prohibition of the specification.

   SHOULD    This word, or the adjective "recommended", means that there
             may exist valid reasons in particular circumstances to
             ignore this item, but the full implications must be
             understood and carefully weighed before choosing a
             different course.

   MAY       This word, or the adjective "optional", means that this
             item is one of an allowed set of alternatives.  An
             implementation which does not include this option MUST be
             prepared to interoperate with another implementation which
             does include the option.


1.3.  Terminology

   datagram     The unit of transmission in the network layer (such as
                IP). A datagram may be encapsulated in one or more
                packets passed to the data link layer.

   frame        The unit of transmission at the data link layer.  A
                frame may include a header and/or a trailer, along with
                some number of units of data.

   packet       The basic unit of encapsulation, which is passed across
                the interface between the network layer and the data
                link layer.  A packet is usually mapped to a frame; the
                exceptions are when data link layer fragmentation is
                being performed, or when multiple packets are
                incorporated into a single frame.




Latvala & Liu          expires September 13, 1997               [Page 3]

Internet Draft     Semi Connected Mode for PPP links      March 13, 1997


   peer         The other end of the point-to-point link.


















































Latvala & Liu          expires September 13, 1997               [Page 4]

Internet Draft     Semi Connected Mode for PPP links      March 13, 1997


2. PPP Link Operation to support Semi Connected Mode

2.1.  Phase Diagram

   SCM mode introduces a new phase called Semi-Connected to the PPP
   diagram:

   +------+        +-----------+           +--------------+
   |      | UP     |           | OPENED    |              | SUCCESS/NONE
   | Dead |------->| Establish |---------->| Authenticate |--+
   |      |        |           |           |              |  |
   +------+        +-----------+           +--------------+  |
      ^               |                        |             |
      |          FAIL |                   FAIL |             |
      +<--------------+             +----------+             |
      |                             |                        |
      |            +-----------+    |           +---------+  |
      |       DOWN |           |    |   CLOSING |         |  |
      +------------| Terminate |<---+<----------| Network |<-+
      |            |           |                |         |
      |            +-----------+                +---------+
      |                                TERMINATE  |     ^
      |                             +-------------+     |
      |                             |                   |
      |                             V                   |
      |                    +----------------+           |
      |         DOWN       |                |           |
      +--------------------| Semi-Connected |-----------+
                           |                | RE-ESTABLISH
                           +----------------+


2.2.  Semi-Connected Phase

   The Semi-Connected phase is reached only from the Network phase. PPP
   MUST terminate the physical link and move to the Semi-Connected phase
   if

      1.   LCP configuration authorized the peer to make a transition to
           the Semi-Connected phase, AND

      2.   the PPP link has been idle longer than the time negotiated in
           the LCP configuration.

   In the Semi-Connected phase PPP observes the data traffic. When PPP
   receives a datagram which is being sent to the peer or must be routed
   through the peer PPP MUST re-establish new a physical link to the
   peer.  After the physical link has been established PPP moves back to



Latvala & Liu          expires September 13, 1997               [Page 5]

Internet Draft     Semi Connected Mode for PPP links      March 13, 1997


   the Network phase.

   PPP MUST also go back to the Network phase when the Up event occurs.
   The Up event indicates that the peer has re-established a physical
   link and is going to send data.

   If PPP determines that it cannot establish a link to the peer it MUST
   move to the Dead phase.











































Latvala & Liu          expires September 13, 1997               [Page 6]

Internet Draft     Semi Connected Mode for PPP links      March 13, 1997


3.  LCP State Translation Table

   The Semi-Connected phase SHOULD be implemented by adding one new
   state, Semi-Connected, six new events, and three new actions to the
   LCP's state translation table. The new events can cause a legal
   transition only in the Request-Sent, Request-Ack, Opened or Semi-
   Connected state which is the reason why only those four states are
   shown in the table below.

   Events                                      Actions

   IDT   = Idle timer expired                  tel = terminate link
   SLN   = Session timer expired               rel = re-establish link
   DSC   = Down event, SCM configured          sst = start session timer
   CSC   = Close event, SCM configured, no peer
   DUP+  = Datagram from the upper layer
   DUP-  = Datagram from the upper layer, no peer


































Latvala & Liu          expires September 13, 1997               [Page 7]

Internet Draft     Semi Connected Mode for PPP links      March 13, 1997


      | State
      |       7             8               9               10
Events|   Ack-Rcvd       Ack-Sent        Opened       Semi-Connected
------+---------------------------------------------------------------
Up    |       -             -               -                9
Down  |       1             1             tld/1              -
Open  |       7             8               9r               -
Close |   irc,str/4     irc,str/4     tld,irc,str/4  rel,tld,irc,str/4
      |
  TO+ |     scr/6         scr/8             -                -
  TO- |     tlf/3p        tlf/3p            -                -
      |
 RCR+ | sst,sca,tlu/9     sca/8       tld,scr,sca/8          -
 RCR- |     scn/7         scn/6       tld,scr,scn/6          -
 RCA  |     scr/6x    sst,irc,tlu/9    tld,scr/6x            -
 RCN  |     scr/6x      irc,scr/8      tld,scr/6x            -
      |
 RTR  |     sta/6         sta/6       tld,zrc,sta/5          -
 RTA  |       6             8           tld,scr/6            -
      |
 RUC  |     scj/7         scj/8           scj/9              -
 RXJ+ |       6             8               9                -
 RXJ- |     tlf/3         tlf/3       tld,irc,str/5          -
      |
 RXR  |       7             8             ser/9              -
      |
 CSC  |       -             -               -              tld/1
 DSC  |       -             -               10               -
 IDT  |       -             -             tel/10             -
 SLN  |       -             -               -              tld/1
 DUP+ |       -             -               -              rel/9
 DUP- |       -             -               -              tld/1


3.1.  States

   Below are more detailed descriptions of the modified states and the
   new Semi-Connected state. The descriptions of the Ack-Received, Ack-
   Sent, and Opened state should not conflict with the descriptions in
   [1]. Rather, the new functionalities can be implemented without
   sacrificing the integrity of the "traditional" PPP implementation.

   Ack-Received

      The Session timer is started when the Receive-Configure-Request
      (RCR+) event takes place and PPP enters the Opened state.

   Ack-Sent



Latvala & Liu          expires September 13, 1997               [Page 8]

Internet Draft     Semi Connected Mode for PPP links      March 13, 1997


      The Session timer is started when the Receive-Configure-Ack (RCA)
      event takes a place and PPP enters the Opened state.

   Opened

      If the PPP is configured to use SCM the implementation MUST keep a
      record which shows how long the PPP link has been idle when it is
      in the Opened state. If the value of the Idle timer is higher than
      the value specified by the Idle-Time field in the Semi Connected
      Mode option the implementation MUST terminate the physical link
      and enter the Semi-Connected state.

      If the implementation and its peer have agreed to use SCM and the
      Down event occurs indicating that the lower layer is not ready to
      carry packets it must enter the Semi-Connected State.

   Implementation Note:

      It is possible that the peer can terminate the physical link after
      PPP has given a frame to the lower layer but before the lower
      layer has successfully transferred the frame to the peer.

      Implementations SHOULD have a functionality which tries to
      estimate whether a frame can be transferred to the peer before the
      peer terminates the link. This functionality reduces the number of
      retransmissions which would take place if ARQ is implemented in
      the data link or in a higher layer.

   Semi-Connected state

      The implementation MUST leave the Semi-Connected state and enter
      the Opened State if:

         1.   The implementation receives a datagram from the upper
              layer and is able to re-establish the physical link, AND

         2.   The Up event occurred indicating that the peer is going to
              send data.

      When the implementation receives a datagram from the upper layer
      but comes to the conclusion that it cannot re-establish the
      physical link it MUST indicate to the upper layers that the PPP
      link is no longer available for network layer traffic and enter
      the Starting state. See Implementation Note below how the
      implementation determines when it cannot re-establish the physical
      link.

      The implementation MAY use a PPP Session timer which determines



Latvala & Liu          expires September 13, 1997               [Page 9]

Internet Draft     Semi Connected Mode for PPP links      March 13, 1997


      the maximum lifetime of a PPP session. If the Session timer
      expires when the LCP automaton is in the Semi Connected state PPP
      MUST indicate to the upper layers that the PPP link is no longer
      available for network layer traffic and enter the Starting state.

      When the Close event occurs PPP MUST try to re-establish the link.
      If it establishes the link successfully the same actions MUST take
      place as when the Close event occurs in the Opened state.

      If PPP fails to re-establish the link it MUST indicate to the
      upper layers that the PPP link is no longer available for its
      network layer traffic and enter the Starting state.

      Implementation Note:

         The Implementation MUST take into consideration the fact that
         both sides can try to re-establish the physical link at the
         same time or that the peer's end-user accepted a regular phone
         call while the implementation was in the Semi-Connected state.
         If the lower layer cannot establish the link and returns a
         value indicating that it received a busy signal the
         implementation SHOULD wait a particular number of seconds
         before trying to re-establish the link. The implementation MAY
         use for example n-persistent Carrier Sense Multiple Access
         (CSMA) protocol to determine how long it waits before trying to
         setup the link again.

         The implementation SHOULD not give up immediately when it fails
         to re-establish the link. The number of times the
         implementation tries to re-establish the link is up to the
         implementation. In some implementations PPP could stay in the
         Semi-Connected state until the Session timer expires.


3.2.  Events

   Close event when SCM configured (CSC)

      This event occurs when the automaton is in the Semi-Connected
      state and the network administrator (human or program) indicates
      that the link is not allowed to be Opened.

   Down event when SCM configured (DSC)

      This event occurs when the PPP link is configured to use SCM, the
      automaton is in the Opened state, and a lower layer indicates that
      it is no longer ready to carry packets.




Latvala & Liu          expires September 13, 1997              [Page 10]

Internet Draft     Semi Connected Mode for PPP links      March 13, 1997


   Idle timer expired (IDT)

      This event occurs when the PPP link is configured to use SCM, the
      automaton is in the Opened state, and the Idle timer expires.

   Session timer expired (SLN)

      This event occurs when the PPP link is configured to use SCM, the
      automaton is in the Semi-Connected state, and the Session timer
      expires.

   Datagram from the upper layer (DUP)

      This event occurs when the PPP link is configured to use SCM, the
      automaton is in the Semi-Connected state, and a upper layer has
      given a packet to PPP to transfer to the peer.

      The DUP+ event indicates that the peer is still available so that
      the physical link can be re-established and packets can be sent to
      the peer.

      The DUP- event indicates that the peer is not available and that
      the physical link cannot be re-established.


3.3.  Actions

   Re-establish link (rel)

      The physical link is re-established.

   Terminate link (tel)

      The physical link is terminated.

   Start session timer (sst)

      This action starts the Session timer.

      Implementation Note:

         Each implementation is free to choose a value for the Maximum-
         Session-Length variable. A session length can vary between PPP
         links, e.g. a company pays a higher rate for bearer services
         and in exchange its session length is increased among other
         things.





Latvala & Liu          expires September 13, 1997              [Page 11]

Internet Draft     Semi Connected Mode for PPP links      March 13, 1997


4.  Semi Connected Mode Option for LCP Configuration

   Description

      This configuration option provides a method to negotiate the usage
      of SCM. By default SCM is not used.

      The implementation MUST specify the time a PPP link is allowed to
      be idle before the physical link is terminated and the LCP
      automaton enters the Semi-Connected state.

      At the end of the configuration both sides MUST agree on the same
      idle time value. In order to ensure that both sides will agree on
      the idle time value the implementation MUST accept the value that
      the peer sent if it is lower than the value that the
      implementation sent to the peer. If the implementation is not
      concerned about the idle time value it SHOULD send the highest
      possible idle time value to the peer.

      The implementation MUST also indicate to the peer if it accpets a
      terminating call. Implementationa which cannot or are not allowed
      make an originating call MUST send back a Configure-Nak packet.

      After the PPP link has been configured and both sides have agreed
      to use SCM the LCP automaton MUST be in the Opened state, one NCP
      automaton supported by the implementation in the Opened state and
      the other NCP automatons in the Initial, Starting, or Opened
      state. This means that LCP automaton cannot enter the Semi-
      Connected state when LCP or NCP is being configured or terminated.

   A summary of the Semi Connected Mode Configuration Option format is
   shown below.  The fields are transmitted from left to right.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |    Length     |           Idle-Time           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |  Accept-Conn  |
   +-+-+-+-+-+-+-+-+


   Type

      20






Latvala & Liu          expires September 13, 1997              [Page 12]

Internet Draft     Semi Connected Mode for PPP links      March 13, 1997


   Length

      5

   Idle-Time

      The Idle-Time field specifies the time in seconds during which the
      PPP link can be idle.

      Value 0 MUST be used only when PPP accepts the Idle-Time field but
      does not accept the Accept-Conn field thus returning a Configure-
      Nak packet where the Idle-Time field is assigned to 0.

   Accept-Conn

      The Accept-Conn field is one octet and indicates whether the peer
      can re-establish the physical link.


          0    Value 0 MUST be used only when PPP accepts the Accept-
               Conn field but does not accept the Idle-Time field thus
               returning a Configure-Nak packet where the Accept-Conn
               field is assigned to 0.

          1    The peer is NOT allowed to re-establish the physical
               link.

          2    The peer is allowed to re-establish the physical link.























Latvala & Liu          expires September 13, 1997              [Page 13]

Internet Draft     Semi Connected Mode for PPP links      March 13, 1997


5.  Security

SCM does not offer a mechanism which allows the implementation to ensure
that the peer which re-established the physical link is indeed the same
peer with whom the implementation established the PPP link.

To prevent an intruder from re-establishing the physical link the
implementation can use the caller ID feature which many PSTNs and PLMNs
offer.


REFERENCES


[1]   Simpson, W., Editor, "The Point-to-Point Protocol (PPP) for the
      Transmission of Multi-protocol Datagrams over Point-to-Point
      Links," RFC 1661, July 1994.

[2]   Perkins, D., "Requirements for an Internet Standard Point-to-Point
      Protocol", RFC 1547, Carnegie Mellon University, December 1993.































Latvala & Liu          expires September 13, 1997              [Page 14]

Internet Draft     Semi Connected Mode for PPP links      March 13, 1997


AUTHORS' ADDRESSES

Questions about this paper can be directed to:

Mikael Latvala
Research Department
Oy LM Ericsson Ab
SF-02420 Jorvas, Finland

Voice:   +358-9-299-2850
Fax:     +358-9-299-3247
E-Mail:  Mikael.Latvala@lmf.ericsson.se

George Liu
System Research Department
Core Unit Radio Systems and Technology
Ericsson Radio Systems
S-164 80 Stockholm, Sweden

Voice:   +46-8-764 1231
Fax:     +46-8-404 7020
E-mail:  George.Liu@era-t.ericsson.se





























Latvala & Liu          expires September 13, 1997              [Page 15]

